
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Текст = "Изменилось количество";

	РассчитатьСуммуСтроки(ТекущиеДанные, Текст);



КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Текст = "Изменилась цена";

	РассчитатьСуммуСтроки(ТекущиеДанные, Текст);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура РассчитатьСуммуСтроки(Строка, ТекстСообщения)
	
	Строка.Сумма = Строка.Количество * Строка.Цена;
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
	
	Сотрудник = ОписаниеЧеловека();
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = Сотрудник.Имя;
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте

Функция ОписаниеЧеловека()
	
	Человек = Новый Структура;
	Человек.Вставить("Имя", "Евгений");
	Человек.Вставить("Возраст", 36);
	Человек.Вставить("ВШтате", Истина);
	// Не является ошибкой. На клиенте вызов ТекущаяДата() допустим
	Человек.Вставить("ДатаПриемаНаРаботу", ТекущаяДата());
	
	Возврат Человек;
	
КонецФункции
#КонецОбласти






